Config/Documents/КорректировкаРасчетовСУчредителем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаРасчетовСУчредителем</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыРасчетовСУчредителями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчредителя</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетАмортизацииОЦИ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПлановСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияТипаУчреждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаОборотами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоУчредителя2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоУчредителя3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПССчетаДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеСчетаДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДоходов3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаткаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАмортизацииОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировкиАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПринятогоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьВыбывшегоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияПринятогоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизацияВыбывшегоОЦИ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/AccumulationRegisters/ОборотыРасчетовСУчредителями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыРасчетовСУчредителями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьУвеличение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУменьшение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияУвеличение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияУменьшение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/Enums/ТипыПлановСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПлановСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляКазенных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляБюджетных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляАвтономных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/КорректировкаРасчетовСУчредителем/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.Контрагент) И ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Организация, "Распорядитель");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.ТекущийТПС) Тогда
			ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), КонецДня(Объект.Дата), КонецДня(ТекущаяДатаСеанса()));
			Данные = ПолучитьДатуИзмененияТипаУчреждения(Объект.Организация, ДатаДокумента);
			Объект.ТекущийТПС = Данные.ТипПланаСчетов;
			Объект.ДатаИзмененияТипаУчреждения = Данные.ДатаИзменения;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СчетДоходов) Тогда
			Объект.СчетДоходов = БухгалтерскийУчет.СчетПоКоду("401.10", Объект.Дата, Объект.Организация);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СчетУчредителя) Тогда
			Объект.СчетУчредителя = БухгалтерскийУчет.СчетПоКоду("210.06", Объект.Дата, Объект.Организация);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.СчетАмортизацииОЦИ) Тогда
			Объект.СчетАмортизацииОЦИ = БухгалтерскийУчет.СчетПоКоду("ОЦИ", Объект.Дата, Объект.Организация);
		КонецЕсли;     
		
		Объект.КорректировкаОборотами = 
			БухгалтерскийУчетПовтИсп.УчетнаяПолитикаОрганизации(Объект.Организация).РасчетыСУчредителемКорректироватьОборотами;	
	КонецЕсли;
	
	ОпределитьПараметрыСчета(Объект.СчетДоходов		, "Доходов");
	ОпределитьПараметрыСчета(Объект.СчетУчредителя	, "Учредителя");
	
	// Типовые операции и дополнительные табличные части	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".  
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	УстановитьВидимостьРеквизитов(ЭтотОбъект);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Данные = ПолучитьДатуИзмененияТипаУчреждения(Объект.Организация, Объект.Дата);
	Объект.ТекущийТПС = Данные.ТипПланаСчетов;
	Объект.ДатаИзмененияТипаУчреждения = Данные.ДатаИзменения;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Данные = ПриИзмененииОрганизацииСервер(Объект.Организация, Объект.Дата);
	
	Объект.Остатки.Очистить();
	
	Объект.Контрагент = Данные.Контрагент;
	Объект.ТекущийТПС = Данные.ТипПланаСчетов;
	Объект.ДатаИзмененияТипаУчреждения = Данные.ДатаИзменения;	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	
	ОпределитьПараметрыСчета(Объект.СчетДоходов, "Доходов");
	УстановитьВидимостьРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчредителяПриИзменении(Элемент)
	
	ОпределитьПараметрыСчета(Объект.СчетУчредителя, "Учредителя");
	УстановитьВидимостьРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОборотамиПриИзменении(Элемент)
	УстановитьВидимостьРеквизитов(ЭтотОбъект);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстатки

&НаКлиенте
Процедура ОстаткиСуммаОстаткаАмортизацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	РассчитатьСуммуКорректировкиСтроки(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСуммаОЦИПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	РассчитатьСуммуКорректировкиСтроки(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиСуммаАмортизацииОЦИПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Остатки.ТекущиеДанные;
	РассчитатьСуммуКорректировкиСтроки(ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	// Чтобы не учитывались проводки этого документа, документ должен быть не проведен
	Если Объект.Проведен Тогда
		Сообщить("Заполнение таблицы возможно только в непроведенном документе.");
		Возврат;
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ТекущийТПС) Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Тип плана счетов");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.ТекущийТПС",, ЕстьОшибки);
	ИначеЕсли Объект.ТекущийТПС = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляКазенных") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не предназначен для казенных учреждений'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Организация");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.Организация",, ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Учредитель");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.Контрагент",, ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетУчредителя) Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Расчеты с учредителем");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.СчетУчредителя",, ЕстьОшибки);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СчетАмортизацииОЦИ) Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Амортизация особо ценного имущества");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.СчетАмортизацииОЦИ",, ЕстьОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаИзмененияТипаУчреждения) И Объект.ДатаИзмененияТипаУчреждения > Объект.Дата Тогда
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Корректность", "Дата изменения",,,
			"Дата изменения должна быть меньше даты документа");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Объект.ДатаИзмененияТипаУчреждения",, ЕстьОшибки);
	КонецЕсли;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Остатки.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьТаблицуПослеЗакрытияВопроса", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Табличная часть будет очищена.
								|Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	Иначе
		Модифицированность = Истина;
		ЗаполнитьТаблицуСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		ЗаполнитьТаблицуСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитов(Форма)
	Объект = Форма.Объект;
	
	//Форма.Элементы.ОстаткиГруппаСуммаОстатка.Видимость = НЕ Объект.КорректировкаОборотами;
	Форма.Элементы.ОстаткиГруппаСуммаОЦИ.Видимость     = НЕ Объект.КорректировкаОборотами;
	Форма.Элементы.ОстаткиГруппаСумма.Видимость        = НЕ Объект.КорректировкаОборотами;

	Форма.Элементы.ОборотыГруппаПринятие.Видимость = Объект.КорректировкаОборотами;
	Форма.Элементы.ОборотыГруппаВыбытие.Видимость  = Объект.КорректировкаОборотами;

	Форма.Элементы.ГруппаИтогов.Видимость = НЕ Объект.КорректировкаОборотами;
	Форма.Элементы.ГруппаИтогиОборотов.Видимость = Объект.КорректировкаОборотами;
	
	Форма.Элементы.ОстаткиПодразделениеСчетаДоходов.Видимость = Форма.ВидимостьПодразделенияСчетДоходов;
	Форма.Элементы.ОстаткиПодразделениеСчетаУчредителя.Видимость = Форма.ВидимостьПодразделенияСчетУчредителя;
КонецПроцедуры	

&НаСервере
Процедура ОпределитьПараметрыСчета(Счет, Префикс)
	
	МаксКоличествоСубконто = БухгалтерскийУчетПовтИсп.ПолучитьМаксКоличествоСубконто();
	КоличествоСубконто = Счет.ВидыСубконто.Количество();
	
	Для Индекс = 1 По МаксКоличествоСубконто Цикл
		Элемент = Элементы.Найти("ОстаткиСубконто" + Префикс + Индекс);
		Если Элемент <> Неопределено Тогда
			Элемент.Видимость = (Индекс <= КоличествоСубконто);
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.КорректировкаОборотами И Префикс = "Учредителя" Тогда
		УчетОСПоПодразделениям = УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям();
		ФлВидимости = Счет.УчетПоПодразделениям ИЛИ УчетОСПоПодразделениям;
	Иначе	
		ФлВидимости = Счет.УчетПоПодразделениям;
	КонецЕсли;	
	ЭтотОбъект["ВидимостьПодразделенияСчет" + Префикс] = ФлВидимости;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДатуИзмененияТипаУчреждения(Организация, Период)
	
	Возврат РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьДатуИзмененияТипаУчреждения(Организация, Период);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПриИзмененииОрганизацииСервер(Организация, Период)
	
	Результат = ПолучитьДатуИзмененияТипаУчреждения(Организация, Период);
	
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация,"Распорядитель");
	Результат.Вставить("Контрагент", Контрагент);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСервер()
	Если Объект.КорректировкаОборотами Тогда
		ЗаполнитьТаблицуПоОборотамСервер();
	Иначе
		ЗаполнитьТаблицуПоОстаткамСервер();
	КонецЕсли;	
КонецПроцедуры

#Область ЗаполнениеДокументаПоОстаткам

&НаСервере
Процедура ЗаполнитьТаблицуПоОстаткамСервер()
	
	ТекстОбъединенияТаблиц = "
		|
		| ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	РазделительПакетаЗапросов = ОбщегоНазначения.РазделительПакетаЗапросов();
	
	ЧастиЗапроса = Новый Массив;
	
	// Получаем текст запроса
	
	ЧастиЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.ИФО КАК ИФО,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ЕПСБУОстатки.СуммаОстаток, 0) КАК Сумма,
	|	0 КАК СуммаАмортизации
	|ПОМЕСТИТЬ ВТ_Баланс
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счет4),
	|			,
	|			Организация = &Организация
	|				И КФО В (&КФО4)) КАК ЕПСБУОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕПСБУОстатки.ИФО,
	|	ЕПСБУОстатки.КФО,
	|	ЕПСБУОстатки.Подразделение,
	|	0,
	|	ЕСТЬNULL(-ЕПСБУОстатки.СуммаОстаток, 0)
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетАм4),
	|			,
	|			Организация = &Организация
	|				И КФО В (&КФО4)) КАК ЕПСБУОстатки");
	
	Если Объект.ТекущийТПС = Перечисления.ТипыПлановСчетов.ДляБюджетных Тогда
		
		ЧастиЗапроса.Добавить(ТекстОбъединенияТаблиц);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУОстатки.ИФО КАК ИФО,
		|	ЕПСБУОстатки.КФО КАК КФО,
		|	ЕПСБУОстатки.Подразделение,
		|	ЕСТЬNULL(ЕПСБУОстатки.СуммаОстаток, 0) КАК Сумма,
		|	0 КАК СуммаАмортизации
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&Период,
		|			Счет В (&Счет2),
		|			,
		|			Организация = &Организация
		|				И КФО В (&КФО2)) КАК ЕПСБУОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕПСБУОстатки.ИФО,
		|	ЕПСБУОстатки.КФО,
		|	ЕПСБУОстатки.Подразделение,
		|	0,
		|	ЕСТЬNULL(-ЕПСБУОстатки.СуммаОстаток, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&Период,
		|			Счет В (&СчетАм2),
		|			,
		|			Организация = &Организация
		|				И КФО В (&КФО2)) КАК ЕПСБУОстатки");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДатаИзмененияТипаУчреждения) Тогда
		
		ЧастиЗапроса.Вставить(0,
		"ВЫБРАТЬ
		|	СобытияОССрезПоследних.ОсновноеСредство
		|ПОМЕСТИТЬ ВТ_Изменения
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)) КАК СобытияОССрезПоследних
		|ГДЕ
		|	СобытияОССрезПоследних.ДатаСобытия < &ДатаИзменения");
		
		ЧастиЗапроса.Вставить(1, РазделительПакетаЗапросов);
		
		ЧастиЗапроса.Добавить(ТекстОбъединенияТаблиц);
		ЧастиЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ЕПСБУОстатки.ИФО КАК ИФО,
		|	ЕПСБУОстатки.КФО КАК КФО,
		|	ЕПСБУОстатки.Подразделение,
		|	ЕСТЬNULL(ЕПСБУОстатки.СуммаОстаток, 0) КАК Сумма,
		|	0 КАК СуммаАмортизации
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&Период,
		|			Счет В (&СчетИзменения),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
		|			Организация = &Организация
		|				И КФО В (&КФОИзменения)
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						ВТ.ОсновноеСредство
		|					ИЗ
		|						ВТ_Изменения КАК ВТ)) КАК ЕПСБУОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕПСБУОстатки.ИФО,
		|	ЕПСБУОстатки.КФО,
		|	ЕПСБУОстатки.Подразделение,
		|	0,
		|	ЕСТЬNULL(-ЕПСБУОстатки.СуммаОстаток, 0)
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&Период,
		|			Счет В (&СчетАмИзменения),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
		|			Организация = &Организация
		|				И КФО В (&КФОИзменения)
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						ВТ.ОсновноеСредство
		|					ИЗ
		|						ВТ_Изменения КАК ВТ)) КАК ЕПСБУОстатки");
		
	КонецЕсли;
	
	ЧастиЗапроса.Добавить(РазделительПакетаЗапросов);
	ЧастиЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ЕПСБУОстаткиУчр.ИФО КАК ИФО,
	|	ЕПСБУОстаткиУчр.КФО КАК КФО,
	|	ЕПСБУОстаткиУчр.КПС КАК КПС,
	|	ЕПСБУОстаткиУчр.Подразделение КАК Подразделение,
	|	ЕПСБУОстаткиУчр.Субконто2 КАК СубконтоУчредителя2,
	|	ЕПСБУОстаткиУчр.Субконто3 КАК СубконтоУчредителя3,
	|	ЕСТЬNULL(-ЕПСБУОстаткиУчр.СуммаОстаток, 0) КАК СуммаОстатка
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет = &СчетУчредителя,
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Учредитель
	|				И КФО В (&КФО)) КАК ЕПСБУОстаткиУчр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Баланс.ИФО,
	|	ВТ_Баланс.КФО,
	|	ВТ_Баланс.Подразделение КАК Подразделение,
	|	СУММА(ВТ_Баланс.Сумма) КАК СуммаОЦИ,
	|	СУММА(ВТ_Баланс.СуммаАмортизации) КАК СуммаАмортизацииОЦИ
	|ИЗ
	|	ВТ_Баланс КАК ВТ_Баланс
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Баланс.ИФО,
	|	ВТ_Баланс.КФО,
	|	ВТ_Баланс.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОстаткиОЦИ.ИФО КАК ИФО,
	|	ЕПСБУОстаткиОЦИ.КФО КАК КФО,
	|	ЕПСБУОстаткиОЦИ.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(-ЕПСБУОстаткиОЦИ.СуммаОстаток, 0) КАК СуммаОстаткаАмортизации
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет = &СчетОЦИ,
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Учредитель
	|				И КФО В (&КФО)) КАК ЕПСБУОстаткиОЦИ");
	
	// Определяем параметры учета, и подменяем поля если учет не ведется
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, "");
	
	УчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	Если Не УчетПоИФО Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстатки.ИФО"		, "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиУчр.ИФО"	, "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиОЦИ.ИФО"	, "ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	
	УчетПоПодр210 = БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("210.06").УчетПоПодразделениям;
	УчетПоПодр101 = УчетПоПодр210 И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("101.00").УчетПоПодразделениям;
	УчетПоПодрОЦИ = УчетПоПодр210 И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("ОЦИ").УчетПоПодразделениям;
	
	Если Не УчетПоПодр210 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиУчр.Подразделение", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	Если Не УчетПоПодр101 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстатки.Подразделение", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	Если Не УчетПоПодрОЦИ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиОЦИ.Подразделение", "ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	// Параметры запроса
	
	Период = Новый Граница(КонецДня(Объект.Дата),ВидГраницы.Включая);
	СчетИзменения	= ?(Объект.ТекущийТПС = Перечисления.ТипыПлановСчетов.ДляБюджетных, "", "101.10,") + "101.20,102.20";
	СчетАмИзменения	= ?(Объект.ТекущийТПС = Перечисления.ТипыПлановСчетов.ДляБюджетных, "", "104.10,") + "104.20,104.29";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("ДатаИзменения"	, Объект.ДатаИзмененияТипаУчреждения);
	Запрос.УстановитьПараметр("Организация"		, Объект.Организация);
	Запрос.УстановитьПараметр("Учредитель"		, Объект.Контрагент);
	Запрос.УстановитьПараметр("СчетУчредителя"	, Объект.СчетУчредителя);
	Запрос.УстановитьПараметр("СчетОЦИ"			, Объект.СчетАмортизацииОЦИ);
	Запрос.УстановитьПараметр("Счет2"			, БухгалтерскийУчетПовтИсп.СписокСчетов("101.10,103.11"));
	Запрос.УстановитьПараметр("Счет4"			, БухгалтерскийУчетПовтИсп.СписокСчетов("101.10,101.20,102.20,103.11"));
	Запрос.УстановитьПараметр("СчетИзменения"	, БухгалтерскийУчетПовтИсп.СписокСчетов(СчетИзменения));
	Запрос.УстановитьПараметр("СчетАм2"			, БухгалтерскийУчетПовтИсп.СписокСчетов("104.10"));
	Запрос.УстановитьПараметр("СчетАм4"			, БухгалтерскийУчетПовтИсп.СписокСчетов("104.10,104.20,104.29"));
	Запрос.УстановитьПараметр("СчетАмИзменения"	, БухгалтерскийУчетПовтИсп.СписокСчетов(СчетАмИзменения));
	Запрос.УстановитьПараметр("КФО"				, ПолучитьМассивКФО("2,4,7"));
	Запрос.УстановитьПараметр("КФО2"			, ПолучитьМассивКФО("2"));
	Запрос.УстановитьПараметр("КФО4"			, ПолучитьМассивКФО("4"));
	Запрос.УстановитьПараметр("КФОИзменения"	, ПолучитьМассивКФО("2,7"));
	
	// Получаем результат
	
	Результат = Запрос.ВыполнитьПакет();
	КоличествоПакетов = Результат.Количество();
	
	Остатки		= Результат[КоличествоПакетов - 3].Выгрузить();
	Баланс		= Результат[КоличествоПакетов - 2].Выгрузить();
	Амортизация	= Результат[КоличествоПакетов - 1].Выгрузить();
	
	ТипКолонки = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(18, 2));
	Остатки.Колонки.Добавить("Сумма"							, ТипКолонки);
	Остатки.Колонки.Добавить("СуммаОЦИ"							, ТипКолонки);
	Остатки.Колонки.Добавить("СуммаОстаткаАмортизации"			, ТипКолонки);
	Остатки.Колонки.Добавить("СуммаАмортизацииОЦИ"				, ТипКолонки);
	Остатки.Колонки.Добавить("СуммаКорректировкиАмортизации"	, ТипКолонки);
	Остатки.Колонки.Добавить("ПодразделениеСчетаДоходов");
	
	РаспределитьБаланс(Баланс, Остатки, УчетПоПодр101);
	РаспределитьАмортизацию(Амортизация, Остатки, УчетПоПодрОЦИ);
	
	Для Каждого ТекущаяСтрока Из Остатки Цикл
		РассчитатьСуммуКорректировкиСтроки(ТекущаяСтрока);
		ТекущаяСтрока.ПодразделениеСчетаДоходов = ТекущаяСтрока.Подразделение;
	КонецЦикла;
	
	Остатки.Сортировать("ИФО,КФО,Подразделение,КПС");
	
	Объект.Остатки.Загрузить(Остатки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивКФО(КФО)
	
	ЗначенияКодов = Новый Соответствие;
	ЗначенияКодов.Вставить("1", Перечисления.КВД.Бюджет);
	ЗначенияКодов.Вставить("2", Перечисления.КВД.Внебюджет);
	ЗначенияКодов.Вставить("3", Перечисления.КВД.ВременноеРаспоряжение);
	ЗначенияКодов.Вставить("4", Перечисления.КВД.СубсидииНаГосзадание);
	ЗначенияКодов.Вставить("5", Перечисления.КВД.СубсидииНаИныеЦели);
	ЗначенияКодов.Вставить("6", Перечисления.КВД.БюджетныеИнвестиции);
	ЗначенияКодов.Вставить("7", Перечисления.КВД.СредстваОМС);
	
	МассивКодов = СтрРазделить(КФО, ",", Ложь);
	
	Результат = Новый Массив;
	Для Каждого Код Из МассивКодов Цикл
		Значение = ЗначенияКодов[СокрЛП(Код)];
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура РаспределитьБаланс(Таблица, Остатки, НужноПодразделение)
	
	Отбор = Новый Структура("ИФО,КФО" + ?(НужноПодразделение, ",Подразделение", ""));
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
		СтрокиТаблицы = Остатки.НайтиСтроки(Отбор);
		
		КолвоСтрок = СтрокиТаблицы.Количество();
		
		Если КолвоСтрок = 0 Тогда
			НоваяСтрока = Остатки.Добавить();
			НоваяСтрока.СуммаОстатка = 0;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ИначеЕсли КолвоСтрок = 1 Тогда
			СтрокиТаблицы[0].СуммаОЦИ			 = СтрокаТаблицы.СуммаОЦИ;
			СтрокиТаблицы[0].СуммаАмортизацииОЦИ = СтрокаТаблицы.СуммаАмортизацииОЦИ;
		Иначе
			РаспределитьСуммуПоСтрокам(СтрокаТаблицы.СуммаОЦИ, СтрокиТаблицы, "СуммаОстатка", "СуммаОЦИ");
			СтрокиТаблицы[0].СуммаАмортизацииОЦИ = СтрокаТаблицы.СуммаАмортизацииОЦИ;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьАмортизацию(Таблица, Остатки, НужноПодразделение)
	
	Отбор = Новый Структура("ИФО,КФО" + ?(НужноПодразделение, ",Подразделение", ""));
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТаблицы);
		СтрокиТаблицы = Остатки.НайтиСтроки(Отбор);
		
		КолвоСтрок = СтрокиТаблицы.Количество();
		
		Если КолвоСтрок = 0 Тогда
			НоваяСтрока = Остатки.Добавить();
			НоваяСтрока.СуммаОстатка = 0;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		ИначеЕсли КолвоСтрок = 1 Тогда
			СтрокиТаблицы[0].СуммаОстаткаАмортизации = СтрокаТаблицы.СуммаОстаткаАмортизации;
		Иначе
			РаспределитьСуммуПоСтрокам(СтрокаТаблицы.СуммаОстаткаАмортизации, СтрокиТаблицы, "СуммаАмортизацииОЦИ", "СуммаОстаткаАмортизации");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммуПоСтрокам(Сумма, Строки, Источник, Приемник);
	
	Дельта = Сумма;
	
	Для Каждого СтрокаТаблицы Из Строки Цикл
		СтрокаТаблицы[Приемник] = СтрокаТаблицы[Источник];
		Дельта = Дельта - СтрокаТаблицы[Источник];
	КонецЦикла;
	
	Строки[0][Приемник] = Строки[0][Приемник] + Дельта;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммуКорректировкиСтроки(ТекущаяСтрока)
	
	ТекущаяСтрока.Сумма                         = ТекущаяСтрока.СуммаОЦИ - ТекущаяСтрока.СуммаОстатка;
	ТекущаяСтрока.СуммаКорректировкиАмортизации = ТекущаяСтрока.СуммаАмортизацииОЦИ - ТекущаяСтрока.СуммаОстаткаАмортизации;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокументаПоОборотам

&НаСервере
Процедура ЗаполнитьТаблицуПоОборотамСервер()   
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕПСБУОстаткиУчр.ИФО КАК ИФО,
	|	ЕПСБУОстаткиУчр.КФО КАК КФО,
	|	ЕПСБУОстаткиУчр.КПС КАК КПС,
	|	ЕСТЬNULL(ЕПСБУОстаткиУчр.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЕПСБУОстаткиУчр.Субконто2 КАК СубконтоУчредителя2,
	|	ЕПСБУОстаткиУчр.Субконто3 КАК СубконтоУчредителя3,
	|	ЕСТЬNULL(-ЕПСБУОстаткиУчр.СуммаОстаток, 0) КАК СуммаОстатка
	|ПОМЕСТИТЬ Остатки21006
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет = &СчетУчредителя,
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Учредитель
	|				И КФО В (&КФО)) КАК ЕПСБУОстаткиУчр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОстаткиОЦИ.ИФО КАК ИФО,
	|	ЕПСБУОстаткиОЦИ.КФО КАК КФО,
	|	ЕСТЬNULL(ЕПСБУОстаткиОЦИ.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	СУММА(ЕСТЬNULL(-ЕПСБУОстаткиОЦИ.СуммаОстаток, 0)) КАК СуммаОстаткаАмортизации
	|ПОМЕСТИТЬ ОстаткиОЦИ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет = &СчетОЦИ,
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Учредитель
	|				И КФО В (&КФО)) КАК ЕПСБУОстаткиОЦИ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕПСБУОстаткиОЦИ.ИФО,
	|	ЕПСБУОстаткиОЦИ.КФО,
	|	ЕСТЬNULL(ЕПСБУОстаткиОЦИ.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСУчредителямиОстатки.ИФО КАК ИФО,
	|	РасчетыСУчредителямиОстатки.КФО КАК КФО,
	|	РасчетыСУчредителямиОстатки.Подразделение КАК Подразделение,
	|	СУММА(РасчетыСУчредителямиОстатки.СтоимостьУвеличениеОстаток) КАК СтоимостьПринятогоОЦИ,
	|	СУММА(РасчетыСУчредителямиОстатки.СтоимостьУменьшениеОстаток) КАК СтоимостьВыбывшегоОЦИ,
	|	СУММА(РасчетыСУчредителямиОстатки.АмортизацияУвеличениеОстаток) КАК АмортизацияПринятогоОЦИ,
	|	СУММА(РасчетыСУчредителямиОстатки.АмортизацияУменьшениеОстаток) КАК АмортизацияВыбывшегоОЦИ
	|ИЗ
	|	РегистрНакопления.ОборотыРасчетовСУчредителями.Остатки(&Период, Организация = &Организация) КАК РасчетыСУчредителямиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСУчредителямиОстатки.ИФО,
	|	РасчетыСУчредителямиОстатки.КФО,
	|	РасчетыСУчредителямиОстатки.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки21006.ИФО КАК ИФО,
	|	Остатки21006.КФО КАК КФО,
	|	Остатки21006.КПС КАК КПС,
	|	Остатки21006.Подразделение КАК Подразделение,
	|	Остатки21006.СубконтоУчредителя2 КАК СубконтоУчредителя2,
	|	Остатки21006.СубконтоУчредителя3 КАК СубконтоУчредителя3,
	|	Остатки21006.СуммаОстатка КАК СуммаОстатка,
	|	ОстаткиОЦИ.СуммаОстаткаАмортизации КАК СуммаОстаткаАмортизации
	|ПОМЕСТИТЬ Остатки21006_ОЦИ1
	|ИЗ
	|	Остатки21006 КАК Остатки21006
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиОЦИ КАК ОстаткиОЦИ
	|		ПО Остатки21006.ИФО = ОстаткиОЦИ.ИФО
	|			И Остатки21006.КФО = ОстаткиОЦИ.КФО
	|			И Остатки21006.Подразделение = ОстаткиОЦИ.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки21006_ОЦИ1.ИФО КАК ИФО,
	|	Остатки21006_ОЦИ1.КФО КАК КФО,
	|	Остатки21006_ОЦИ1.КПС КАК КПС,
	|	Остатки21006_ОЦИ1.Подразделение КАК Подразделение,
	|	Остатки21006_ОЦИ1.СубконтоУчредителя2 КАК СубконтоУчредителя2,
	|	Остатки21006_ОЦИ1.СубконтоУчредителя3 КАК СубконтоУчредителя3,
	|	Остатки21006_ОЦИ1.СуммаОстатка КАК СуммаОстатка,
	|	Остатки21006_ОЦИ1.СуммаОстаткаАмортизации КАК СуммаОстаткаАмортизации
	|ИЗ
	|	Остатки21006_ОЦИ1 КАК Остатки21006_ОЦИ1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки21006.ИФО,
	|	Остатки21006.КФО,
	|	Остатки21006.КПС,
	|	Остатки21006.Подразделение,
	|	Остатки21006.СубконтоУчредителя2,
	|	Остатки21006.СубконтоУчредителя3,
	|	Остатки21006.СуммаОстатка,
	|	0
	|ИЗ
	|	Остатки21006 КАК Остатки21006
	|ГДЕ
	|	НЕ (Остатки21006.ИФО, Остатки21006.КФО, Остатки21006.Подразделение) В
	|				(ВЫБРАТЬ
	|					Таб.ИФО,
	|					Таб.КФО,
	|					Таб.Подразделение
	|				ИЗ
	|					Остатки21006_ОЦИ1 КАК Таб)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиОЦИ.ИФО,
	|	ОстаткиОЦИ.КФО,
	|	ЗНАЧЕНИЕ(Справочник.КБК.ПустаяСсылка),
	|	ОстаткиОЦИ.Подразделение,
	|	NULL,
	|	NULL,
	|	0,
	|	ОстаткиОЦИ.СуммаОстаткаАмортизации
	|ИЗ
	|	ОстаткиОЦИ КАК ОстаткиОЦИ
	|ГДЕ
	|	НЕ (ОстаткиОЦИ.ИФО, ОстаткиОЦИ.КФО, ОстаткиОЦИ.Подразделение) В
	|				(ВЫБРАТЬ
	|					Таб.ИФО,
	|					Таб.КФО,
	|					Таб.Подразделение
	|				ИЗ
	|					Остатки21006_ОЦИ1 КАК Таб)";

	Запрос = Новый Запрос(ТекстЗапроса);
	Период = Новый Граница(КонецДня(Объект.Дата),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период"         , Период);
	Запрос.УстановитьПараметр("Организация"    , Объект.Организация);
	Запрос.УстановитьПараметр("Учредитель"     , Объект.Контрагент);
	Запрос.УстановитьПараметр("СчетУчредителя" , Объект.СчетУчредителя);
	Запрос.УстановитьПараметр("СчетОЦИ"        , Объект.СчетАмортизацииОЦИ);
	Запрос.УстановитьПараметр("КФО"            , ПолучитьМассивКФО("2,4,7")); 
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОборотыНФА = Результат[2].Выгрузить();     
	Остатки21006_ОЦИ = Результат[4].Выгрузить();
	
	ТипЧисло18_2 = Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(18, 2));
	Остатки21006_ОЦИ.Колонки.Добавить("СтоимостьПринятогоОЦИ", ТипЧисло18_2);
	Остатки21006_ОЦИ.Колонки.Добавить("СтоимостьВыбывшегоОЦИ", ТипЧисло18_2);
	Остатки21006_ОЦИ.Колонки.Добавить("АмортизацияПринятогоОЦИ", ТипЧисло18_2);
	Остатки21006_ОЦИ.Колонки.Добавить("АмортизацияВыбывшегоОЦИ", ТипЧисло18_2);
	Остатки21006_ОЦИ.Колонки.Добавить("ПодразделениеСчетаДоходов");
	
	ОборотыНФА.Колонки.Добавить("Отработано", Новый ОписаниеТипов("Булево"));

	Отбор = Новый Структура("ИФО, КФО, Подразделение");
	
	Для каждого СтрокаОстатки21006_ОЦИ из Остатки21006_ОЦИ Цикл
		СтрокаОстатки21006_ОЦИ.ПодразделениеСчетаДоходов = СтрокаОстатки21006_ОЦИ.Подразделение;
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаОстатки21006_ОЦИ);
		
		СтрокиОборотыНФА = ОборотыНФА.НайтиСтроки(Отбор);
		// Здесь может быть не больше одной строки
		Если СтрокиОборотыНФА.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОстатки21006_ОЦИ, СтрокиОборотыНФА[0], 
				"СтоимостьПринятогоОЦИ, СтоимостьВыбывшегоОЦИ, АмортизацияПринятогоОЦИ, АмортизацияВыбывшегоОЦИ");
			
			СтрокиОборотыНФА[0].Отработано = Истина;
		КонецЕсли;	                         
	КонецЦикла;	

	Для каждого СтрокаОборотыНФА из ОборотыНФА Цикл
		Если СтрокаОборотыНФА.Отработано Тогда
			Продолжить;
		КонецЕсли;	   
		
		СтрокаОстатки21006_ОЦИ = Остатки21006_ОЦИ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОстатки21006_ОЦИ, СтрокаОборотыНФА);
		СтрокаОборотыНФА.Отработано = Истина;
	КонецЦикла;	

	Объект.Остатки.Загрузить(Остатки21006_ОЦИ);
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
